[
    {
       "id": 1,
       "category": 1,
       "postDate": "2024-07-01",
       "featureImage": "https://hips.hearstapps.com/hmg-prod/images/mower-1568302588.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*",
       "price": 499.99,
       "title": "Lawnmower",
       "body": "Lawn mowers are loud. While standard gas-powered mowers usually operate at 95 decibels -- equivalent to the racket made by a motorcycle revving its engine -- electric mowers max out at around 75 decibels on average, closer to the din of a washing machine. If you live in a neighborhood, an electric mower is the less disruptive option.",
       "published": true
    },
    {
       "id": 2,
       "category": 1,
       "postDate": "2024-07-01",
       "featureImage": "https://media-www.canadiantire.ca/product/seasonal-gardening/backyard-living/outdoor-cooking/0850062/weber-charcoal-performance-grill-2bd844a3-0672-4b13-8f95-54da6a295548.png?imdensity=1&imwidth=1244&impolicy=gZoom",
       "price": 279.99,
       "title": "Weber BBQ",
       "body": "The powerful performance and convenient features of the Performer charcoal grill is your excuse to ignite the coals every day. Prep food on the work table, hang grilling accessories from the tool hooks, and then clean up with ease—but only after you’ve taken every last bite of your perfectly grilled meal.",
       "published": true
    },
    {
       "id": 3,
       "category": 2,
       "postDate": "2024-07-01",
       "featureImage": "https://www.cnet.com/a/img/resize/ae4f67a3738cdec860f0cad5726b50b5a3a40133/hub/2021/03/08/17e4fce6-2c5a-4749-af10-330a9c35a72a/ps5-playstation-5-sony-hoyle-promo-4.jpg?auto=webp&fit=crop&height=675&width=1200",
       "price": 439.99,
       "title": "PS5",
       "body": "The PlayStation 5 (PS5) is a home video game console developed by Sony Interactive Entertainment. It was announced as the successor to the PlayStation 4 in April 2019, was launched on November 12, 2020, in Australia, Japan, New Zealand, North America, and South Korea, and was released worldwide a week later. The PS5 is part of the ninth generation of video game consoles, along with Microsoft's Xbox Series X/S consoles, which were released in the same month.",
       "published": true
    },
    {
       "id": 4,
       "category": 2,
       "postDate": "2024-07-01",
       "featureImage": "https://gamehoard.com/cdn/shop/files/619Bmcg-EIL.__AC_SY300_SX300_QL70_ML2_300x.jpg?v=1717917006",
       "price": 689.99,
       "title": "XBOX ONE",
       "body": "The Xbox One S 1 TB Console offers superior gaming performance and a massive storage capacity. With its sleek design and state-of-the-art technology, experience immersive gameplay and elevate your entertainment system. Upgrade to the ultimate gaming experience with the Xbox One S 1 TB Console.",
       "published": true
    },
    {
       "id": 5,
       "category": 3,
       "postDate": "2024-07-01",
       "featureImage": "https://veirdo.in/cdn/shop/files/b_0119493a-9927-4550-8323-baefe5f625c0.jpg?v=1716202861&width=360",
       "price": 19.99,
       "title": "TShirt",
       "body": "Doodle Black Oversized Back Graphic Printed Tshirt.",
       "published": true
    },
    {
       "id": 6,
       "category": 3,
       "postDate": "2024-07-01",
       "featureImage": "https://m.media-amazon.com/images/I/41I-ttZRMtL._AC_SX679_.jpg",
       "price": 49.99,
       "title": "Shorts",
       "body": "Maximum agility. Nike Dry fabric helps you stay dry and comfortable. Elastic waistband with drawstring for an adjustable fit. Slim fit provides optimal performance. The Nike Dri-FIT Park 3 shorts have been revisited with skewed seams, so you can stay focused on your game. Its soft sweat-wicking fabric keeps you dry, while the elastic waistband is mesh lined for optimal desirability. This product is made entirely from recycled polyester fibers.",
       "published": true
    },
    {
       "id": 7,
       "category": 4,
       "postDate": "2024-07-01",
       "featureImage": "https://m.media-amazon.com/images/I/61ni9RHUGML._AC_SX679_.jpg",
       "price": 79.99,
       "title": "Baseball",
       "body": "Box of 6 RLLB1 baseballs",
       "published": true
    },
    {
       "id": 8,
       "category": 4,
       "postDate": "2024-07-01",
       "featureImage": "https://m.media-amazon.com/images/I/51yZGU5iGKL.__AC_SX300_SY300_QL70_ML2_.jpg",
       "price": 62.45,
       "title": "Soccer Ball",
       "body": "The soft and durable cover provides a reliable feel for the ball. The rubber bladder ensures pressure and shape retention.",
       "published": true
    },
    {
       "id": 9,
       "category": 5,
       "postDate": "2024-07-01",
       "featureImage": "https://m.media-amazon.com/images/I/71jXnq6a+tL._AC_SX679_.jpg",
       "price": 71.99,
       "title": "Dog Food",
       "body": "Big dogs need lots of love, and Hill's Science Diet Large Breed Puppy dry food is specially made with a delicious chicken flavor and an optimal level of calcium for controlled bone growth: a unique developmental need of large breed puppies. Give your large dog his or her best start in life so they can grow to their full potential with balanced minerals that promote strong bones and strong teeth. This dog food made with natural ingredients uses DHA from fish oil to support your large dog's eye development and brain function. High-quality protein helps your large dog build and maintain muscle. There’s more to love with the new look of Science Diet. Some of our products also have new names, new kibble shapes & new formulas.",
       "published": true
    },
    {
       "id": 10,
       "category": 5,
       "postDate": "2024-07-01",
       "featureImage": "https://m.media-amazon.com/images/I/81WafamyBwL._AC_SX679_.jpg",
       "price": 9.99,
       "title": "Fish Food",
       "body": "Fishkeeping enthusiasts have looked to the Tetra name for products and solutions that add ease and beauty to their home",
       "published": true
    },
    {
      "id": 11,
      "category": 1,
      "postDate": "2024-07-01",
      "featureImage": "https://m.media-amazon.com/images/I/81KTCnnXzTL._AC_SX679_.jpg",
      "price": 79.27,
      "title": "Table",
      "body": "Morden design Desk: Great for home office, studio, bedroom and also kitchen as a dinning table.",
      "published": true
    },
    {
      "id": 12,
      "category": 1,
      "postDate": "2024-07-01",
      "featureImage": "https://www.thebrick.com/cdn/shop/products/sawylgsf_hc_800x700.jpg?v=1696285312",
      "price": 599.75,
      "title": "Sofa",
      "body": "The sofa is ready to bring a contemporary flair to any room in your home. Linen-look fabric cloaks this couch in a light grey hue – perfect for pairing with other decor choices to create a space all your own. Track armrests and fabric piping underscore the furniture's clean lines, while tapered plastic feet offer support without clashing against the upholstery. Inside the cushions, high-density foam is wrapped with fibre to keep your lounging comfortable..",
      "published": true
    },
    {
      "id": 13,
      "category": 2,
      "postDate": "2024-07-01",
      "featureImage": "https://m.media-amazon.com/images/I/91iNA1YOFjL._AC_SX522_.jpg",
      "price": 1899.99,
      "title": "Samsung 65 TV",
      "body": "QUANTUM MATRIX W/ MINI LEDS: See every freckle on your favorite actor’s face thanks to the huge grid of Samsung’s ultra-precise Quantum Mini LEDs that take control of the individual zones of light in your picture for sensational color and contrast.",
      "published": true
    },
    {
      "id": 14,
      "category": 2,
      "postDate": "2024-07-01",
      "featureImage": "https://m.media-amazon.com/images/I/61IzIJBZafL.__AC_SY300_SX300_QL70_ML2_.jpg",
      "price": 1597.87,
      "title": "Samsung S24 Ultra",
      "body": "The Samsung Galaxy S24 Ultra is a flagship Android smartphone with a 6.8-inch Dynamic LTPO AMOLED 2X display, Snapdragon 8 Gen 3 chipset, 1024 GB storage, and powerful AI-enhanced cameras12. It’s sleek, water-resistant, and features an embedded S Pen for a unique user experience1. Tech experts praise its battery life and camera capabilities, but note Samsung’s software can be overwhelming3.",
      "published": true
    },
    {
      "id": 15,
      "category": 3,
      "postDate": "2024-07-01",
      "featureImage": "https://cdn.suitsupply.com/image/upload/b_rgb:efefef,bo_300px_solid_rgb:efefef,c_pad,w_2600/b_rgb:efefef,c_pad,dpr_1,w_1270,h_2286,f_auto,q_auto,fl_progressive/products/Jackets/default/Summer/C7334_1.jpg",
      "price": 649.00,
      "title": "Black Suit",
      "body": "This versatile black blazer is cut to a tailored fit with a classic notch lapel and a natural unpadded shoulder.",
      "published": true
    },
    {
      "id": 16,
      "category": 3,
      "postDate": "2024-07-01",
      "featureImage": "https://www.military1st.ca/media/catalog/product/cache/5a00cd016b3f37b532962c32d4295d0e/b/r/brandit_sherpa_denim_jacket_blue_off_white_001_1.jpg",
      "price": 159.98,
      "title": "Denim Jacket",
      "body": "Denim Jacket from Brandit is a warm jacket with a timeless design. It comes with a soft teddy fleece lining and is made of durable cotton material. What is more, it features two chest pockets, two side pockets and adjustable handcuffs. This jacket is ideal for individuals looking for a casual, stylish everyday denim jacket for cold weather season.",
      "published": true
    },
    {
      "id": 17,
      "category": 4,
      "postDate": "2024-07-01",
      "featureImage": "https://m.media-amazon.com/images/I/81pkjvvZcjL._AC_SX679_.jpg",
      "price": 35.95,
      "title": "Basketball",
      "body": "Harness the drive that will propel you to the next level of the game, with the Wilson NBA DRV Pro Basketball. The Tackskin Cover offers a new cushion layer with ultimate grip in all weather conditions. Inflation retention lining creates longer lasting air retention with this ball designed for ultimate outdoor durability.",
      "published": true
    },
    {
      "id": 18,
      "category": 4,
      "postDate": "2024-07-01",
      "featureImage": "https://m.media-amazon.com/images/I/81pkjvvZcjL._AC_SX679_.jpg",
      "price": 99.99,
      "title": "Volleyball",
      "body": "The best players on the beach are always one step ahead. When you can read and react to where the game is going, you can be too. The breakthrough design of the OPTX AVP Tour Game Volleyball brings a whole new visual approach to the beach. New VST™ (visual spin technology) uses strategic color variance to enhance the human eye’s ability to detect spin on the ball. A vibrant color palette and Optic Flow graphics allow the ball to be more easily tracked in the diverse environments of beach volleyball, like clouds, sky, sand, water, and crowds. Using the same construction as the original AVP game ball, you can expect the same signature Wilson performance. With the OPTX AVP Volleyball, you’ll see the game like never before.",
      "published": true
    },
    {
      "id": 19,
      "category": 5,
      "postDate": "2024-07-01",
      "featureImage": "https://m.media-amazon.com/images/I/81y+atXqpVL._AC_SX679_.jpg",
      "price": 67.28,
      "title": "Cat Food",
      "body": "Whether your cat has a noticeable weight issue, or you would just like to keep your feline friend at a healthy weight, Hill's Science Diet Perfect weight Dry cat food provides your adult cat with delicious, breakthrough weight management nutrition. With a savory chicken flavor, over 70% of pets lost weight within 10 weeks when fed this this adult cat kibble. This cat food Made with natural ingredients provides high-quality protein that will keep your kitty satisfied between meals while maintaining lean muscle. There’s more to love with the new look of science Diet. Some of our products also have new names, new kibble shapes & new formulas.",
      "published": true
    },
    {
      "id": 20,
      "category": 5,
      "postDate": "2024-07-01",
      "featureImage": "https://liwopet.com/cdn/shop/files/S3be6331e75b446d0ad8591115d08ff826_994x994.webp?v=1714125099",
      "price": 27.23,
      "title": "Pet Collar",
      "body": "Crafted from soft, flexible material that bends easily without restricting movement, this collar offers ultimate comfort and minimizes risks for your pet. The adjustable design ensures a perfect fit for pet, allowing for free and unencumbered movement",
      "published": true
    },
    {
      "id": 21,
      "category": 1,
      "postDate": "2024-07-01",
      "featureImage": "https://assets.wfcdn.com/im/94889724/resize-h1000-w1000%5Ecompr-r85/2692/269251383/Esai+Wood+Raised+Garden+Bed.jpg",
      "price": 175.99,
      "title": "Garden Bed",
      "body": "his garden planter is separated into two growing areas for different plants or planting methods. The baffle can be removed to form a bigger growing area.",
      "published": true
    },
    {
      "id": 22,
      "category": 1,
      "postDate": "2024-07-01",
      "featureImage": "https://m.media-amazon.com/images/I/71baqOpWumL._AC_SX679_.jpg",
      "price": 89.99,
      "title": "Lamp",
      "body": "The torchiere design and colors fit well with mid century modern, casual, contemporary or even boho décor. This contemporary, slender lamp slides unobtrusively into narrow corners.",
      "published": true
    },
    {
      "id": 23,
      "category": 2,
      "postDate": "2024-07-01",
      "featureImage": "https://i.dell.com/is/image/DellContent//content/dam/images/products/electronics-and-accessories/dell/monitors/dell-gaming/s3422dwg/s3422dwg-xfp-01-bk.psd?fmt=png-alpha&pscan=auto&scl=1&hei=476&wid=524&qlt=100,1&resMode=sharp2&size=524,476&chrss=full",
      "price": 499.99,
      "title": "Dell Gaming Monitor",
      "body": "34 inch curved WQHD monitor with VESA Display HDR 400, a 144Hz refresh rate providing a truly immersive gaming experience.",
      "published": true
    },
    {
      "id": 24,
      "category": 2,
      "postDate": "2024-07-01",
      "featureImage": "https://m.media-amazon.com/images/I/71762Q7xlOL._AC_SX522_.jpg",
      "price": 1366.67,
      "title": "Skytech Gaming PC Desktop",
      "body": "The Skytech Chronos ST-CHRONOS-0826-W-AM is a pre-built gaming PC featuring an Intel Core i5-12400F processor, 16GB DDR4 RAM, an NVIDIA GeForce RTX 4060 graphics card with 8GB GDDR6X memory, a 1TB NVME SSD, and Windows 11 Home. Designed for gaming and productivity, it offers reliable performance in a sleek white case with WiFi connectivity.",
      "published": true
    },
    {
      "id": 25,
      "category": 4,
      "postDate": "2024-07-01s",
      "featureImage": "https://m.media-amazon.com/images/I/41FHr7oclLL._AC_.jpg",
      "price": 104.99,
      "title": "Cricket Bat",
      "body": "Made from most premium Kashmir Willow. Traditionally shaped and styled for maximum stability & Power while playing shots.",
      "published": true
    },
    {
      "id": 26,
      "category": 4,
      "postDate": "2024-07-01",
      "featureImage": "https://m.media-amazon.com/images/I/71mCg4W4mRL._AC_SY879_.jpg",
      "price": 530.97,
      "title": "Golf Kit",
      "body": "The strata 12 piece set is designed for maximum performance right out of the box; the set includes: driver, 3 wood, 5 hybrid, 6 - 9 iron, pw, putter, stand bag and 2 head covers.",
      "published": true
    },
    {
      "id": 27,
      "category": 3,
      "postDate": "2024-07-01",
      "featureImage": "https://www.theoutnet.com/variants/images/1647597302767259/F/w1020_q80.jpg",
      "price": 239.00,
      "title": "Chelsea Boot",
      "body": "Famed for impeccably handmade shoes and bags, Italian label Tod's designs are luxurious but don't compromise on versatility or practicality. From the legendary 'D-Bag' to the classic 'Gommino' suede loafers, each collection has something beautiful to slot into your daily wardrobe.",
      "published": true
    },
    {
      "id": 28,
      "category": 3,
      "postDate": "2024-07-01",
      "featureImage": "https://m.media-amazon.com/images/I/81qKlEuGscL._AC_SY879_.jpg",
      "price": 239.99,
      "title": "Aptro Long Coat",
      "body": "Single breasted, simple stylish collar, fleece lining, detachable scarf, above knee length, 2 side pockets, 1 inner pocket, and long sleeves with buttoned cuffs.",
      "published": true
    },
    {
      "id": 29,
      "category": 5,
      "postDate": "2024-07-01",
      "featureImage": "https://m.media-amazon.com/images/I/71Goi4AFbCL._AC_SL1500_.jpg",
      "price": 487.43,
      "title": "Cat Condo Furniture",
      "body": "Step-like jump multi-layer structure design; For more cats use; 2 roomy condos; 2 top large platform with internal extra-thick mat; Funny toys; Natural sisal rope.",
      "published": true
    },
    {
      "id": 30,
      "category": 5,
      "postDate": "2024-07-01",
      "featureImage": "https://s7d2.scene7.com/is/image/PetSmart/5262353?$CLEARjpg$",
      "price": 104.39,
      "title": "Fish Tank",
      "body": "Create your very own magical underwater world with the Top Fin Essentials SK 10 Gallon Desk Aquarium. This aquarium has a capacity of 10 gallons, and comes with a variety of components including a glass tank, LED Lighting, heater, power filter and more. Your fish will love this spacious and beautiful home, and you will love the incredible aesthetic it brings to your home.",
      "published": true
    }
  ]  